"""
Имя проекта: practicum-1
Номер версии: 1.0
Имя файла: 21.py
Автор: 2020 © Д.П. Юткина, Челябинск
Лицензия использования:  CC BY-NC 4.0 (https://creativecommons.org/licenses/by-nc/4.0/deed.ru)
Дата создания: 30/11/2020
Дата последней модификации: 30/11/2020
Описание: Решение задачи 21 практикума № 1
#версия Python: 3.8
"""

"""
Определить значение функции Z = 1/(XY ) при произвольных X и Y .
"""
X = int(input("Введите X:"))
Y = int(input("Введите Y:"))
Z = 1/(X*Y)
print("Значение функции равно", Z)
