"""
Имя проекта: practicum-1
Номер версии: 1.0
Имя файла: 5.py
Автор: 2020 © Д.П. Юткина, Челябинск
Лицензия использования:  CC BY-NC 4.0 (https://creativecommons.org/licenses/by-nc/4.0/deed.ru)
Дата создания: 11/11/2020
Дата последней модификации: 11/11/2020
Связанные файлы/пакеты: 
Описание: Решение задачи 5 практикума № 1
#версия Python: 3.8
"""

"""
Известен объем информации в байтах. Перевести в килобайты, мегабайты.
"""
b=256
kb=float(b)/float(1024)
print(kb)
mb=float(kb)/float(1024)
print(mb)
