"""
Имя проекта: practicum-1
Номер версии: 1.0
Имя файла: practicum-1(№2).py
Автор: 2020 © Д.П. Юткина, Челябинск
Лицензия использования:  CC BY-NC 4.0 (https://creativecommons.org/licenses/by-nc/4.0/deed.ru)
Дата создания: 11/11/2020
Дата последней модификации: 11/11/2020
Связанные файлы/пакеты: min, max
Описание: Решение задачи 2 практикума № 1
#версия Python: 3.6
"""

"""
Оригинал публикации: Практикум №1 - набиваем руку|Бизнес-информатика 2020
"""

A=2.0
B=8
C=6.12

Min=min(A,B,C)
Max=max(A,B,C)

print("Min = ", Min)
print("Max = ", Max)
