"""
Имя проекта: practicum-1
Номер версии: 1.0
Имя файла: Задание 9.py
Автор: 2020 © Д.П. Юткина, Челябинск
Лицензия использования:  CC BY-NC 4.0 (https://creativecommons.org/licenses/by-nc/4.0/deed.ru)
Дата создания: 13/11/2020
Дата последней модификации: 13/11/2020
Связанные файлы/пакеты: numpy, random
Описание: Решение задачи 9 практикума № 1
#версия Python: 3.8
"""

"""

"""
import random
n= random.randint(1, 100)
print("Число:", n)
if n%2==1:
    print("Нечётное")
else:
    print("Чётное")
if n%7==0:
    print("Кратно 7")
else:
    print("Не кратно 7")
