"""
Имя проекта: practicum-1
Номер версии: 1.0
Имя файла: Задание 7.py
Автор: 2020 © Д.П. Юткина, Челябинск
Лицензия использования:  CC BY-NC 4.0 (https://creativecommons.org/licenses/by-nc/4.0/deed.ru)
Дата создания: 13/11/2020
Дата последней модификации: 13/11/2020
Связанные файлы/пакеты: numpy, random
Описание: Решение задачи 7 практикума № 1
#версия Python: 3.8
"""

"""

"""
import random
n= random.randint(1, 100)
print("Число:", n)
if n%2==0:
    print("Чётное")
else:
    print("Нечётное")
if n%4==0:
    print("Кратно 4")
else:
    print("Не кратно 4")
