"""
Имя проекта: practicum-1
Номер версии: 1.0
Имя файла: practicum-1(№3).py
Автор: 2020 © Д.П. Юткина, Челябинск
Лицензия использования:  CC BY-NC 4.0 (https://creativecommons.org/licenses/by-nc/4.0/deed.ru)
Дата создания: 11/11/2020
Дата последней модификации: 11/11/2020
Связанные файлы/пакеты: math,
Описание: Решение задачи 3 практикума № 1
#версия Python: 3.6
"""

"""
Оригинал публикации: Практикум №1 - набиваем руку|Бизнес-информатика 2020
"""
g=2000
kg=g/1000
print(kg)
t=g/1000000
print(t)
